In [1]:
import numpy as np
import pandas as pd

In [5]:
data = {
    'name': ['Geraldo', 'João', 'Pedro', 'Carlos'],
    'company': ['FB', 'FL', 'BNB', 'FB'],
    'sales': [10000, 15000, 8000, 3500]
}

df = pd.DataFrame(data)
df.head()

      name company  sales
0  Geraldo      FB  10000
1     João      FL  15000
2    Pedro     BNB   8000
3   Carlos      FB   3500

In [11]:
df['company'].unique()

array(['FB', 'FL', 'BNB'], dtype=object)

In [15]:
df[df['sales']>=10000]

      name company  sales
0  Geraldo      FB  10000
1     João      FL  15000

In [21]:
df.loc[df['sales']>=10000]

      name company  sales
0  Geraldo      FB  10000
1     João      FL  15000

In [24]:
df[(df['sales']>=10000) & (df['company'] == 'FB')]

      name company  sales
0  Geraldo      FB  10000

In [25]:
def plus_sale(x):
    return x + 500

In [27]:
df['sales'].apply(plus_sale)

0    10500
1    15500
2     8500
3     4000
Name: sales, dtype: int64

In [29]:
df['sales'].apply(lambda x: x+500)

0    10500
1    15500
2     8500
3     4000
Name: sales, dtype: int64

In [30]:
df.sort_values(by='sales', )

      name company  sales
3   Carlos      FB   3500
2    Pedro     BNB   8000
0  Geraldo      FB  10000
1     João      FL  15000